In [1]:
people = {
    'first' : ['Anurag', 'Jane', 'John'],
    'last' : ['Timilsina', 'Doe', 'Doe'],
    'email' : ['anurag.timilsina@gmail.com', 'janedoe@gmail.com', 'johndoe@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first       last                       email
0  Anurag  Timilsina  anurag.timilsina@gmail.com
1    Jane        Doe           janedoe@gmail.com
2    John        Doe           johndoe@gmail.com

In [5]:
df['first'] + ' ' + df['last']

0    Anurag Timilsina
1            Jane Doe
2            John Doe
dtype: object

In [6]:
df['full_name'] = df['first'] + ' ' + df['last']

In [7]:
df

    first       last                       email         full_name
0  Anurag  Timilsina  anurag.timilsina@gmail.com  Anurag Timilsina
1    Jane        Doe           janedoe@gmail.com          Jane Doe
2    John        Doe           johndoe@gmail.com          John Doe

In [8]:
df.drop(columns=['first','last'], inplace=True)

In [9]:
df

                        email         full_name
0  anurag.timilsina@gmail.com  Anurag Timilsina
1           janedoe@gmail.com          Jane Doe
2           johndoe@gmail.com          John Doe

In [14]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [15]:
df

                        email         full_name   first       last
0  anurag.timilsina@gmail.com  Anurag Timilsina  Anurag  Timilsina
1           janedoe@gmail.com          Jane Doe    Jane        Doe
2           johndoe@gmail.com          John Doe    John        Doe

In [16]:
df.append({'first' : "Tony"}, ignore_index=True)

                        email         full_name   first       last
0  anurag.timilsina@gmail.com  Anurag Timilsina  Anurag  Timilsina
1           janedoe@gmail.com          Jane Doe    Jane        Doe
2           johndoe@gmail.com          John Doe    John        Doe
3                         NaN               NaN    Tony        NaN

In [17]:
people = {
    'first' : ['Tony','steve'],
    'last' : ['Stark', 'Rogers'],
    'email' : ['IronMan@avenge.com','captain@avenge.com']
}

In [18]:
df2 = pd.DataFrame(people)

In [19]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  steve  Rogers  captain@avenge.com

In [26]:
df = df.append(df2, ignore_index=True)

In [27]:
df

                        email         full_name   first       last
0  anurag.timilsina@gmail.com  Anurag Timilsina  Anurag  Timilsina
1           janedoe@gmail.com          Jane Doe    Jane        Doe
2           johndoe@gmail.com          John Doe    John        Doe
3          IronMan@avenge.com               NaN    Tony      Stark
4          captain@avenge.com               NaN   steve     Rogers

In [28]:
filt = df['last'] == 'Doe'

In [29]:
df.drop(index=df[filt].index)

                        email         full_name   first       last
0  anurag.timilsina@gmail.com  Anurag Timilsina  Anurag  Timilsina
3          IronMan@avenge.com               NaN    Tony      Stark
4          captain@avenge.com               NaN   steve     Rogers